
# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа
# данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать
# у пользователя, а указать явно, в программе.

var_list = [2, 'text', 7.0, 456, 'one', False]

for i in var_list:
    var_type = type(i)
    print(var_type)










